{"context":"http://schema.org","@type":"JobPosting","datePosted":"2023-11-06T23:55:45.000Z","description":"&lt;p&gt;eLocal is a dynamic and rapidly growing digital advertising company that connects millions of consumers all over the country with the local professionals they need, when they need them. Since shifting to WFH in March 2020, we have built a thriving remote work culture with a powerful sense of community and high levels of employee retention and engagement. At eLocal, we prioritize the health and wellbeing of our workforce and see this commitment as critical to the success of our business.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We are now looking to add a new member to our People Team who will help us maintain these high standards while constantly innovating to ensure our culture and HR services alway meet the needs of our people. The ideal candidate is an experienced HR professional who is accustomed to working in a small organization and high-growth environment and who knows what it means to own specific HR functions and outcomes. If this sounds like you, and if you're passionate about people and professional advancement, consider joining eLocal where you will play a key part in the growth of a great company!&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;u&gt;Responsibilities&lt;/u&gt;&lt;/strong&gt;:&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;In this role, you will assume managerial responsibility for certain areas of HR operations early on, and with success you will have the opportunity to expand the scope of your position and set the pace of your own advancement. We are looking for someone who has the capacity and drive to become more of a partner to our Chief People Officer than a direct report. Owning these areas means working with a small team to ensure consistent, successful execution of day-to-day operations with minimal oversight, and embracing eLocal’s ethos of continuous improvement. Initial areas of responsibility will be:&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;strong&gt;HR information and processes:&lt;/strong&gt; Ensure that all HR information is accurately recorded, updated and maintained in our HRIS (ADP WorforceNow) and other platforms, and that all basic HR processes – e.g., onboarding, promotions, compensation changes, terminations, etc – are well designed and consistently executed to support the smooth functioning of the organization.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;strong&gt;Benefits:&lt;/strong&gt; Work closely with our benefits broker and insurance carriers to administer the company’s medical plans and other health and welfare plans, and play a key role in determining the company’s benefits strategy.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;strong&gt;Employee relations and communication:&lt;/strong&gt; Handle or manage all typical employee relations matters and maintain effective channels of communication between employees and leadership, addressing employee concerns (whether on an individual, departmental or companywide level) and facilitating open and constructive dialogue throughout the organization in keeping with eLocal’s commitment to an open and honest company culture.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;strong&gt;Culture and engagement:&lt;/strong&gt; Working collaboratively with the company’s employee committees (People Committee, Corporate Social Responsibility Committee, DE&amp;amp;I Committee, and Health &amp;amp; Wellbeing Committee) and leadership team, drive a positive and inclusive organizational culture where employees feel motivated, engaged, and aligned with eLocal's mission and values. Manage the company’s administration of its annual engagement survey through Great Place to Work™ and design strategic initiatives and improvements aimed at addressing areas of weakness uncovered in the survey and improving eLocal’s GPTW survey scores the next year.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;strong&gt;Special events:&lt;/strong&gt; Own the design, planning and execution of special events such as virtual and in-person companywide meetings, team-building, holiday parties, contests, etc.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;u&gt;Qualifications &amp;amp; Skills:&lt;/u&gt;&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;You should apply for this position if…&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;You have 7+ years of HR generalist or HR managerial experience working in a small organization (&amp;lt; 300 employees);&lt;/li&gt;&lt;li&gt;Your experience includes at least two years of managing other HR team members and having managerial responsibility for multiple HR functions at once (i.e., some combination of HRIS, benefits, payroll, employee relations, employee recognition, onboarding, engagement and retention, workforce planning, performance management, training and development, talent acquisition, employer branding, and legal compliance);&lt;/li&gt;&lt;li&gt;You have substantial experience working in HRIS and payroll systems – significant experience working specifically in ADP’s WorkforceNow platform would be a major plus;&lt;/li&gt;&lt;li&gt;You’re a people person – you are empathetic with strong communication skills and a customer service mentality;&lt;/li&gt;&lt;li&gt;You beam with pride when asked about your organizational skills, time management skills, and attention to detail;&lt;/li&gt;&lt;li&gt;You’re innovative –analytical and data-driven but creative and solution-oriented;&lt;/li&gt;&lt;li&gt;You want to work from home but also want to see your coworkers in person from time to time – this is a remote position, but ideally you live within a reasonable drive of our Conshohocken, PA office for recurring or as-needed visits;&lt;/li&gt;&lt;li&gt;You have a bachelor's degree, preferably in Human Resource Management or a similarly relevant field.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;If you are an HR manager who is passionate about serving people, would like to maximize your impact on your next employer’s culture and workforce, and want to take on a role with tremendous room for rapid advancement, we encourage you to apply and join us!&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;About eLocal&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;span class=\"ql-cursor\"&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;If you are looking for the fun and growth opportunities of a startup coupled with the support and backing of a stable corporate parent, eLocal is for you. We are a fast-growing, virtual-first workforce of 160 largely spread across the US (and more recently Canada), with a corporate office in the Philadelphia area where we were founded. For over a decade, eLocal has been one of the leading digital advertising platforms for local and regional commerce. Now with the backing of Brookfield Asset Management – one of the largest investment companies in the world – we are scaling our operation and growing our footprint in the industry faster than ever.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We are a certified Great Place to Work™ in 2023-2024 for the fourth year in a row! Year after year, our people overwhelmingly say they would recommend eLocal to friends and family as a great place to work.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We’re still growing and we want you to be a part of our journey. At eLocal, we value our employees and we live our values! We offer an extremely generous benefits package that includes:&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Competitive salary with substantial annual performance-based bonus.&lt;/li&gt;&lt;li&gt;Participation in long-term incentive plan.&lt;/li&gt;&lt;li&gt;Heavily subsidized Medical through Blue Cross Blue Shield (95% to 82% company-paid), Dental and Vision.&lt;/li&gt;&lt;li&gt;100% company-paid Short-Term Disability, Long-Term Disability and Life/AD&amp;amp;D Insurance.&lt;/li&gt;&lt;li&gt;Monthly wellness stipend and spending account.&lt;/li&gt;&lt;li&gt;Flexible, uncapped Paid Time Off.&lt;/li&gt;&lt;li&gt;401(k) with company match.&lt;/li&gt;&lt;li&gt;Extremely positive company culture – we work hard, but people enjoy working here and enjoy working together!&lt;/li&gt;&lt;li&gt;Work-From-Home position.&lt;/li&gt;&lt;/ul&gt;","employmentType":"FULL_TIME","hiringOrganization":{"@type":"Organization","name":"eLocal","sameAs":"https://www.linkedin.com/company/elocal","logo":"https://media.licdn.com/dms/image/D4E0BAQF8jbxwDb4aBg/company-logo_200_200/0/1689084349215/elocal_logo?e=2147483647&amp;v=beta&amp;t=vpQvgcrhD2lR_N54OuA9Ul1vmfgCrO4-j5H_AEnb92k"},"identifier":{"@type":"PropertyValue","name":"eLocal"},"image":"https://media.licdn.com/dms/image/D4E0BAQF8jbxwDb4aBg/company-logo_100_100/0/1689084349215/elocal_logo?e=2147483647&amp;v=beta&amp;t=4S_7-nx4EvYet2LdxKnplg1yU7_-M8HYZtrCGxRoEb4","industry":"Advertising Services","jobLocation":{"@type":"Place","address":{"@type":"PostalAddress","addressCountry":"US","addressLocality":"Greater Philadelphia","addressRegion":null,"streetAddress":null},"latitude":39.906075,"longitude":-75.16684},"skills":"","title":"Human Resources (HR) Manager/ Senior Manager","validThrough":"2023-12-06T23:55:45.000Z","educationRequirements":{"@type":"EducationalOccupationalCredential","credentialCategory":"bachelor degree"},"experienceRequirements":{"@type":"OccupationalExperienceRequirements","monthsOfExperience":84}}
